In [0]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [0]:
df = pd.read_csv('purchase.csv')
df.head()

      Age  Income Student CreditRating buysComputer
0   young    high      no         fair           no
1   young    high      no         good           no
2  middle    high      no         fair          yes
3   young  medium     yes         fair           no
4     old  medium      no         fair          yes

In [0]:
le = LabelEncoder()
df['Age'] = le.fit_transform(df['Age'])
df['Income'] = le.fit_transform(df['Income'])
df['Student'] = le.fit_transform(df['Student'])
df['CreditRating'] = le.fit_transform(df['CreditRating'])
df['buysComputer'] = le.fit_transform(df['buysComputer'])
df.head()

   Age  Income  Student  CreditRating  buysComputer
0    2       0        0             1             0
1    2       0        0             2             0
2    0       0        0             1             1
3    2       2        1             1             0
4    1       2        0             1             1

In [0]:
X = df.iloc[:, :4]
y = df.iloc[:, 4]
print(X.shape, y.shape)
X.head()

(30, 4) (30,)

   Age  Income  Student  CreditRating
0    2       0        0             1
1    2       0        0             2
2    0       0        0             1
3    2       2        1             1
4    1       2        0             1

In [0]:
y.head()

0    0
1    0
2    1
3    0
4    1
Name: buysComputer, dtype: int64

In [0]:
y.value_counts()

1    16
0    14
Name: buysComputer, dtype: int64

In [0]:
df.groupby('buysComputer').mean()

                   Age    Income   Student  CreditRating
buysComputer
0             1.214286  1.071429  0.285714          1.00
1             0.937500  1.125000  0.437500          1.25

In [0]:
df.groupby('Age').mean()

       Income   Student  CreditRating  buysComputer
Age
0    1.000000  0.444444      1.444444      0.666667
1    1.200000  0.200000      1.200000      0.500000
2    1.090909  0.454545      0.818182      0.454545

In [0]:
df.groupby('CreditRating').mean()

                   Age    Income   Student  buysComputer
CreditRating
0             1.333333  1.000000  0.166667      0.000000
1             1.285714  0.928571  0.500000      0.857143
2             0.600000  1.400000  0.300000      0.400000

In [0]:
train_x, test_x, train_y, test_y = train_test_split(X, y, test_size=0.15, random_state=0)
print(train_x.shape, test_x.shape)
print(train_y.shape, test_y.shape)

(25, 4) (5, 4)
(25,) (5,)

In [0]:
gnb = GaussianNB()
gnb.fit(train_x, train_y)

GaussianNB(priors=None, var_smoothing=1e-09)

In [0]:
pred_y = gnb.predict(test_x)
val = accuracy_score(test_y, pred_y)
val*100

80.0